Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
      ДвиженияПоРегистрам(Отказ, Режим)


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ, Режим)
	
		// регистр ДвижениеДенегФакт Расход
	Движения.ДвижениеДенегФакт.Записывать = Истина;
	Движение = Движения.ДвижениеДенегФакт.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Источник = Источник;
	Движение.Сумма = Сумма;

	
КонецПроцедуры
